# Pandas Data Frame

In [21]:
import pandas as pd
import numpy as np

In [22]:
data = np.random.randn(4,3)

In [23]:
data

array([[-1.20993689,  0.67072653, -0.41204672],
       [-1.34549396, -0.04702579,  1.00284972],
       [ 0.20282702, -0.13733123, -0.69268182],
       [ 0.10549859, -0.38757063,  0.31652866]])

In [24]:
dataFrame = pd.DataFrame(data)

In [25]:
dataFrame

          0         1         2
0 -1.209937  0.670727 -0.412047
1 -1.345494 -0.047026  1.002850
2  0.202827 -0.137331 -0.692682
3  0.105499 -0.387571  0.316529

In [26]:
yeniDataFrame = pd.DataFrame(data, index = ["Atıl", "Mehmet", "Atlas", "Zeynep"], columns = ["Maaş", "Yaş", "Saat"] )

In [27]:
yeniDataFrame

            Maaş       Yaş      Saat
Atıl   -1.209937  0.670727 -0.412047
Mehmet -1.345494 -0.047026  1.002850
Atlas   0.202827 -0.137331 -0.692682
Zeynep  0.105499 -0.387571  0.316529

In [28]:
yeniDataFrame["Yaş"]

Atıl      0.670727
Mehmet   -0.047026
Atlas    -0.137331
Zeynep   -0.387571
Name: Yaş, dtype: float64

In [29]:
yeniDataFrame["Saat"]

Atıl     -0.412047
Mehmet    1.002850
Atlas    -0.692682
Zeynep    0.316529
Name: Saat, dtype: float64

In [31]:
yeniDataFrame[["Maaş", "Yaş"]]

            Maaş       Yaş
Atıl   -1.209937  0.670727
Mehmet -1.345494 -0.047026
Atlas   0.202827 -0.137331
Zeynep  0.105499 -0.387571

In [34]:
yeniDataFrame.loc["Atıl"] # location

Maaş   -1.209937
Yaş     0.670727
Saat   -0.412047
Name: Atıl, dtype: float64

In [35]:
yeniDataFrame.iloc[1] # index bazlı location

Maaş   -1.345494
Yaş    -0.047026
Saat    1.002850
Name: Mehmet, dtype: float64

In [38]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"]

In [39]:
yeniDataFrame

            Maaş       Yaş      Saat  Emeklilik Yaşı
Atıl   -1.209937  0.670727 -0.412047        1.341453
Mehmet -1.345494 -0.047026  1.002850       -0.094052
Atlas   0.202827 -0.137331 -0.692682       -0.274662
Zeynep  0.105499 -0.387571  0.316529       -0.775141

In [43]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1)

            Maaş       Yaş      Saat
Atıl   -1.209937  0.670727 -0.412047
Mehmet -1.345494 -0.047026  1.002850
Atlas   0.202827 -0.137331 -0.692682
Zeynep  0.105499 -0.387571  0.316529

In [44]:
yeniDataFrame.drop("Mehmet")

            Maaş       Yaş      Saat  Emeklilik Yaşı
Atıl   -1.209937  0.670727 -0.412047        1.341453
Atlas   0.202827 -0.137331 -0.692682       -0.274662
Zeynep  0.105499 -0.387571  0.316529       -0.775141

In [45]:
yeniDataFrame.drop("Mehmet", axis = 0)

            Maaş       Yaş      Saat  Emeklilik Yaşı
Atıl   -1.209937  0.670727 -0.412047        1.341453
Atlas   0.202827 -0.137331 -0.692682       -0.274662
Zeynep  0.105499 -0.387571  0.316529       -0.775141

In [46]:
yeniDataFrame

            Maaş       Yaş      Saat  Emeklilik Yaşı
Atıl   -1.209937  0.670727 -0.412047        1.341453
Mehmet -1.345494 -0.047026  1.002850       -0.094052
Atlas   0.202827 -0.137331 -0.692682       -0.274662
Zeynep  0.105499 -0.387571  0.316529       -0.775141

In [47]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1, inplace=True)

In [48]:
yeniDataFrame

            Maaş       Yaş      Saat
Atıl   -1.209937  0.670727 -0.412047
Mehmet -1.345494 -0.047026  1.002850
Atlas   0.202827 -0.137331 -0.692682
Zeynep  0.105499 -0.387571  0.316529

In [50]:
yeniDataFrame.loc["Atıl"]["Maaş"]

-1.2099368930675618

In [51]:
yeniDataFrame.loc["Atlas", "Yaş"]

-0.1373312321732781

In [52]:
yeniDataFrame < 0

         Maaş    Yaş   Saat
Atıl     True  False   True
Mehmet   True   True  False
Atlas   False   True   True
Zeynep  False   True  False

In [55]:
booleanFrame = yeniDataFrame < 0

In [57]:
booleanFrame

         Maaş    Yaş   Saat
Atıl     True  False   True
Mehmet   True   True  False
Atlas   False   True   True
Zeynep  False   True  False

In [58]:
yeniDataFrame

            Maaş       Yaş      Saat
Atıl   -1.209937  0.670727 -0.412047
Mehmet -1.345494 -0.047026  1.002850
Atlas   0.202827 -0.137331 -0.692682
Zeynep  0.105499 -0.387571  0.316529

In [59]:
yeniDataFrame[booleanFrame]

            Maaş       Yaş      Saat
Atıl   -1.209937       NaN -0.412047
Mehmet -1.345494 -0.047026       NaN
Atlas        NaN -0.137331 -0.692682
Zeynep       NaN -0.387571       NaN

In [60]:
yeniDataFrame[yeniDataFrame < 0]

            Maaş       Yaş      Saat
Atıl   -1.209937       NaN -0.412047
Mehmet -1.345494 -0.047026       NaN
Atlas        NaN -0.137331 -0.692682
Zeynep       NaN -0.387571       NaN

In [61]:
yeniDataFrame[yeniDataFrame["Yaş"] > 0]

          Maaş       Yaş      Saat
Atıl -1.209937  0.670727 -0.412047

In [62]:
yeniDataFrame.reset_index()

    index      Maaş       Yaş      Saat
0    Atıl -1.209937  0.670727 -0.412047
1  Mehmet -1.345494 -0.047026  1.002850
2   Atlas  0.202827 -0.137331 -0.692682
3  Zeynep  0.105499 -0.387571  0.316529

In [63]:
yeniIndexListesi = ["Atı","Meh","Atl", "Zey"]

In [64]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [65]:
yeniDataFrame

            Maaş       Yaş      Saat Yeni Indeks
Atıl   -1.209937  0.670727 -0.412047         Atı
Mehmet -1.345494 -0.047026  1.002850         Meh
Atlas   0.202827 -0.137331 -0.692682         Atl
Zeynep  0.105499 -0.387571  0.316529         Zey

In [66]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maaş       Yaş      Saat
Yeni Indeks
Atı         -1.209937  0.670727 -0.412047
Meh         -1.345494 -0.047026  1.002850
Atl          0.202827 -0.137331 -0.692682
Zey          0.105499 -0.387571  0.316529

In [67]:
yeniDataFrame

            Maaş       Yaş      Saat Yeni Indeks
Atıl   -1.209937  0.670727 -0.412047         Atı
Mehmet -1.345494 -0.047026  1.002850         Meh
Atlas   0.202827 -0.137331 -0.692682         Atl
Zeynep  0.105499 -0.387571  0.316529         Zey

In [68]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [69]:
yeniDataFrame

                 Maaş       Yaş      Saat
Yeni Indeks
Atı         -1.209937  0.670727 -0.412047
Meh         -1.345494 -0.047026  1.002850
Atl          0.202827 -0.137331 -0.692682
Zey          0.105499 -0.387571  0.316529

## Multi Index

In [70]:
ilkIndeksler = ["Simpson", "Simpson", "Simpson", "Southpark", "Southpark", "Southpark"]

In [71]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [72]:
birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))

In [73]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('Southpark', 'Cartman'),
 ('Southpark', 'Kenny'),
 ('Southpark', 'Kyle')]

In [74]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [75]:
birlesmisIndeks

MultiIndex([(  'Simpson',   'Homer'),
            (  'Simpson',    'Bart'),
            (  'Simpson',   'Marge'),
            ('Southpark', 'Cartman'),
            ('Southpark',   'Kenny'),
            ('Southpark',    'Kyle')],
           )

In [76]:
benimCartoonListem = [[40,"A"], [10,"B"], [30,"C"], [9,"D"], [10,"E"], [11, "F"]]

In [77]:
cartoonNumpyDizisi = np.array(benimCartoonListem)

In [78]:
cartoonDataFrame = pd.DataFrame(cartoonNumpyDizisi, index=birlesmisIndeks, columns = ["Yaş", "Meslek"])

In [79]:
cartoonDataFrame

                  Yaş Meslek
Simpson   Homer    40      A
          Bart     10      B
          Marge    30      C
Southpark Cartman   9      D
          Kenny    10      E
          Kyle     11      F

In [80]:
cartoonDataFrame.loc["Simpson"]

      Yaş Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [82]:
cartoonDataFrame.loc["Southpark"].loc["Kenny"]

Yaş       10
Meslek     E
Name: Kenny, dtype: object

In [83]:
cartoonDataFrame.index.names = ["Film Adı", "İsim"]

In [84]:
cartoonDataFrame

                  Yaş Meslek
Film Adı  İsim
Simpson   Homer    40      A
          Bart     10      B
          Marge    30      C
Southpark Cartman   9      D
          Kenny    10      E
          Kyle     11      F